app/controllers/listings_controller.rb

  def seller
    @listings = Listing.where(user_id: current_user.id)
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = 6 ORDER BY created_at DESC

  def index
    @listings = Listing.all.order("created_at DESC")
---
SELECT "listings".* FROM "listings" ORDER BY created_at DESC

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id
    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "name", "price", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "listings"."id" = 7  [["image_file_name", "2012-04-21_13.21.24.jpg"], ["image_file_size", 605247], ["image_updated_at", Fri, 04 Apr 2014 20:55:13 UTC +00:00], ["updated_at", Fri, 04 Apr 2014 20:55:15 UTC +00:00]]