app/controllers/orders_controller.rb

  def sales
     @orders = Order.all.where(seller: current_user).order("created_at DESC")
---
SELECT "orders".* FROM "orders" WHERE "orders"."seller_id" = 4 ORDER BY created_at DESC

  def purchases
           @orders = Order.all.where(buyer: current_user).order("created_at DESC")
---
SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = 4 ORDER BY created_at DESC

  def new
    @order = Order.new
    @listing = Listing.find(params[:listing_id])
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", "6"]]

  def create
    @order = Order.new(order_params)
    @listing = Listing.find(params[:listing_id])
    @seller = @listing.user

    @order.listing_id = @listing.id
    @order.buyer_id = current_user.id
    @order.seller_id = @seller.id

    respond_to do |format|
      if @order.save
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", "6"]]
INSERT INTO "orders" ("address", "buyer_id", "city", "created_at", "listing_id", "seller_id", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)